#Напишите программу, которая будет преобразовывать десятичное число в двоичное.
a=int(input())
rez_bin=bin(a)
print(rez_bin [2:])